<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of IP in menu bar and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.hobbithardcase.munki.IPinmenubar</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>IP in menu bar</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>This small application runs in the background and shows the current IP address of your Mac in the menu bar. There are options available to customize the appearance of the menu entry. The IP dddress is updated regulary. Switch on the Router option if you are behind a router or gateway. You can still see your local IP address in the menu.</string>
			<key>developer</key>
			<string>Christian Schmitz Software GmbH</string>
			<key>icon_name</key>
			<string>IP in menu bar.png</string>
			<key>category</key>
			<string>Utilities</string>
			<key>display_name</key>
			<string>IP in Menu Bar</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.hobbithardcase.download.IPinmenubar</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
