<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Art View and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.hobbithardcase.munki.ArtView</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Art View 2</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Art View</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Preview Creative Cloud and Creative Suite documents. Art View improves Quick Look icons, thumbnails and previews for Creative Cloud and Creative Suite users.
Art View is a major time saver that allows graphic designers to preview, inspect, and reveal dependent font and image files from within Apple’s Quick Look preview feature.

But the ability to preview is only the beginning. Illustrator and InDesign documents are not only pretty to look at, but they also show useful information like what images are linked within the document, what fonts have been used, what colors are defined and a whole lot more. And to make things even better, clicking fonts and linked images reveal their files in Finder. It’s miraculous what Quick Look can do with Art View.

This app requires a serial number. Please contact IT for assistance.</string>
			<key>developer</key>
			<string>Code Line</string>
			<key>display_name</key>
			<string>Art View</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>icon_name</key>
			<string>ArtView.png</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.hobbithardcase.download.ArtView</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
